app/controllers/inteligencia_controller.rb

  def duvas
  a = Array.new
	b = Array.new

  	@nombre = params[:nombre_usuario]
  	@descrip = params[:deescripcion]

   #@duvalin = duvalin.find(1);
   #@nombre=@duvalin.nombre;


    @muestra1 = Duvalin.select("nombre", "desrip").where(:id => 2)
---
SELECT nombre, desrip FROM "duvalins" WHERE "duvalins"."id" = 1

    #  a@= Duvalin.all? { |"nombre"|  }
   # b@= Duvalin.all? { |"desrip"|  }
	 # @ejemplo = Duvalin.create({nombre: @nombre, desrip: @descrip})
  	@parte1 = Duvalin.order("desrip").limit(1).offset(3)
  	@parte2 = Duvalin.order("desrip").limit(1).offset(15)

          @tconsulta1= Duvalin.find_by_id(2)
---
SELECT "duvalins".* FROM "duvalins" ORDER BY desrip DESC LIMIT 1 OFFSET 1
SELECT "duvalins".* FROM "duvalins" WHERE "duvalins"."id" = ? LIMIT 1  [["id", 1]]